export const getTooltipData = (id: string) => {
  switch (id) {
    case "steeling-1":
      return {
        title: "حادثة سرقة",
        description:
          "حدثت عملية سطو في هذه المنطقة وقام أحد السامريين بالإبلاغ عن هذه الحادثة وقد فقد متعلقاته الشخصية",
        id: "steeling-1",
        time: "3:00PM",
        coordinates: [54.3677923606792, 24.45710802783229],
      };
    case "steeling-2":
      return {
        title: "حادثة سرقة",
        description:
          "حدثت عملية سطو في هذه المنطقة وقام أحد السامريين بالإبلاغ عن هذه الحادثة وقد فقد متعلقاته الشخصية",
        id: "steeling-2",
        time: "5:00PM",
        coordinates: [54.37045311202198, 24.459295627162984],
      };
    case "steeling-3":
      return {
        title: "حادثة سرقة",
        description:
          "حدثت عملية سطو في هذه المنطقة وقام أحد السامريين بالإبلاغ عن هذه الحادثة وقد فقد متعلقاته الشخصية",
        id: "steeling-3",
        time: "2:00AM",
        coordinates: [54.36654781569629, 24.46343633616228],
      };
    case "steeling-4":
      return {
        title: "حادثة سرقة",
        description:
          "حدثت عملية سطو في هذه المنطقة وقام أحد السامريين بالإبلاغ عن هذه الحادثة وقد فقد متعلقاته الشخصية",
        id: "steeling-4",
        time: "1:00AM",
        coordinates: [54.36521744002491, 24.459842521059503],
      };
    case "criminal-1":
      return {
        title: "تجارة المخدرات",
        description:
          "تم الإبلاغ عن بيع هذه المنطقة للعديد من المخدرات غير المشروعة المختلفة وأصبح الكثير من الناس مدمنين عليها",
        id: "criminal-1",
        time: "3:00PM",
        coordinates: [55.70899666536416, 24.21103227070148],
      };
    case "criminal-2":
      return {
        title: "تجارة المخدرات",
        description:
          "تم الإبلاغ عن بيع هذه المنطقة للعديد من المخدرات غير المشروعة المختلفة وأصبح الكثير من الناس مدمنين عليها",
        id: "criminal-2",
        time: "5:00PM",
        coordinates: [54.92622078645791, 23.548009060712616],
      };
    case "criminal-3":
      return {
        title: "تجارة المخدرات",
        description:
          "تم الإبلاغ عن بيع هذه المنطقة للعديد من المخدرات غير المشروعة المختلفة وأصبح الكثير من الناس مدمنين عليها",
        id: "criminal-3",
        time: "2:00AM",
        coordinates: [54.30823982942666, 22.947401058614098],
      };
    case "criminal-4":
      return {
        title: "تجارة المخدرات",
        description:
          "تم الإبلاغ عن بيع هذه المنطقة للعديد من المخدرات غير المشروعة المختلفة وأصبح الكثير من الناس مدمنين عليها",
        id: "criminal-4",
        time: "1:00AM",
        coordinates: [53.41285408723916, 22.997976123533984],
      };
    case "criminal-5":
      return {
        title: "تجارة المخدرات",
        description:
          "تم الإبلاغ عن بيع هذه المنطقة للعديد من المخدرات غير المشروعة المختلفة وأصبح الكثير من الناس مدمنين عليها",
        id: "criminal-5",
        time: "4:00AM",
        coordinates: [52.61359871614541, 24.043087207002724],
      };
    case "report-1":
      return {
        title: "الإبلاغ عن جريمة",
        description:
          "تم الإبلاغ عن نشاط إجرامي في هذه المنطقة ووصلت الشرطة للتحقيق",
        id: "report-1",
        time: "3:00PM",
        coordinates: [55.9486903564129, 25.761599997721977],
      };
    case "report-2":
      return {
        title: "الإبلاغ عن جريمة",
        description:
          "تم الإبلاغ عن نشاط إجرامي في هذه المنطقة ووصلت الشرطة للتحقيق",
        id: "report-2",
        time: "5:00PM",
        coordinates: [55.94182390133477, 25.73438728088847],
      };
    case "report-3":
      return {
        title: "الإبلاغ عن جريمة",
        description:
          "تم الإبلاغ عن نشاط إجرامي في هذه المنطقة ووصلت الشرطة للتحقيق",
        id: "report-3",
        time: "1:30PM",
        coordinates: [55.92105419098602, 25.726499103585933],
      };
    case "report-4":
      return {
        title: "الإبلاغ عن جريمة",
        description:
          "تم الإبلاغ عن نشاط إجرامي في هذه المنطقة ووصلت الشرطة للتحقيق",
        id: "report-4",
        time: "11:00AM",
        coordinates: [55.899682349555356, 25.746176137277313],
      };
    default:
      return {
        title: "حادثة سرقة",
        description:
          "حدثت عملية سطو في هذه المنطقة وقام أحد السامريين بالإبلاغ عن هذه الحادثة وقد فقد متعلقاته الشخصية",
        id: "steeling-1",
        time: "3:00PM",
        coordinates: [54.3677923606792, 24.45710802783229],
      };
  }
};
