const News = () => {
  return (
    <div className="absolute bottom-5 w-full h-9 pt-1 bg-[#FE4241] text-white shadow-md">
      <div className="relative flex overflow-x-hidden z-10 w-full h-10">
        <div className="animate-marquee whitespace-nowrap child:text-sm child:mx-4">
          <span>
            تم الإبلاغ عن 5 حادثة سرقة في مدينة خليفة، حيث كانت اغلب عملايات
            السرقة في فيلل مستقلة لا يزال المشتبه بهم طلقاء
          </span>
          <span>
            تعرض شخص واحد من الجالية النيجيرية للإعتداء في منطقة المنهل أصيب
            الضحية بجروح خطيرة تم القبض على المشتبه
          </span>
          <span>
            ضبطت الشرطة 1 كيلو غرام من مخدرات الماريجوانا في منطقة مصفح في
            المربع رقم 15، وهذه ليست المرة الأولى حيث لوحظ انتشار لجرائم
            المخدرات في هذه لمنطقة تم القبض على 3 أشخاص من الجالية الأوغندية
          </span>
          <span>
            يعد مركز شرطة المدينة الشامل من اكثر المراكز اهمية في منطقة رأس
            الخيمة، حيث يتلقى بمعدل 10 بلاغات مقلقة اسبوعيا
          </span>
          <span>
            وقد لوحظ انه بالأونة الأخيرة، تلقى المركز بلاغات مقلقة بشكل متزايد
            في منطقة الاختصاص التابعة له وهي منطقة العرقوب
          </span>
        </div>

        <div className="absolute top-0 animate-marquee2 whitespace-nowrap child:text-sm child:mx-4">
          <span>
            تم الإبلاغ عن 5 حادثة سرقة في مدينة خليفة، حيث كانت اغلب عملايات
            السرقة في فيلل مستقلة لا يزال المشتبه بهم طلقاء
          </span>
          <span>
            تعرض شخص واحد من الجالية النيجيرية للإعتداء في منطقة المنهل أصيب
            الضحية بجروح خطيرة تم القبض على المشتبه
          </span>
          <span>
            ضبطت الشرطة 1 كيلو غرام من مخدرات الماريجوانا في منطقة مصفح في
            المربع رقم 15، وهذه ليست المرة الأولى حيث لوحظ انتشار لجرائم
            المخدرات في هذه لمنطقة تم القبض على 3 أشخاص من الجالية الأوغندية
          </span>
          <span>
            يعد مركز شرطة المدينة الشامل من اكثر المراكز اهمية في منطقة رأس
            الخيمة، حيث يتلقى بمعدل 10 بلاغات مقلقة اسبوعيا
          </span>
          <span>
            وقد لوحظ انه بالأونة الأخيرة، تلقى المركز بلاغات مقلقة بشكل متزايد
            في منطقة الاختصاص التابعة له وهي منطقة العرقوب
          </span>
        </div>
      </div>
    </div>
  );
};

export default News;
